# Задание 1
k = int(input("Введите k: "))
for i in range(k + 1):
    print(f'Корень числа {i} равен {i ** 2}, а куб равен {i ** 3}')
# Задание 2
a = 1
n = int(input("Введите кол-во часов: "))
n //= 3
for i in range(n):
    a *= 2
print(f"{a} амёб будет через {n} часов.")
